Revit 2027 API
BuiltInFailures.SketchFailures.LinesOverlap Property
 Cannot have overlapping lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinesOverlap { get; }
Public Shared ReadOnly Property LinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinesOverlap {
	FailureDefinitionId^ get ();
}
static member LinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace